# Zone Dehumidification Set Point Property

Source: https://www.revitapidocs.com/2026/946a9b55-58a5-a173-a5b1-75214a2b7e3b.htm

---

| Zone Dehumidification Set Point Property |
| --- |

**Note: This API is now obsolete.**

Get or set the DeHumidification Set Point of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")]
public double DehumidificationSetPoint { get; set; }
```

```
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")>
Public Property DehumidificationSetPoint As Double
	Get
	Set
```

```
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")]
property double DehumidificationSetPoint {
	double get ();
	void set (double value);
}
```

```
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")>]
member DehumidificationSetPoint : float with get, set
```

#### Property Value

Double Remarks This property is used to get or set the DeHumidification Set Point of the Zone. See Also

#### Reference

Zone Class Autodesk.Revit.DB.Mechanical Namespace